//#include <stdio.h>
//
////【问题描述】
////给定数列 1, 1, 1, 3, 5, 9, 17, …，从第 4 项开始，每项都是前 3 项的和。求
////第 20190324 项的最后 4 位数字。
////【答案提交】
////这是一道结果填空的题，你只需要算出结果后提交即可。本题的结果为一个 4 位整数（提示：答案的千位不为 0），在提交答案时只填写这个整数，填写多余的内容将无法得分。
//int main(){
//	long dp[20190324];
//	dp[1] = dp[2] = dp[3] = 1;
//	for (int i = 4; i <= 20190324; ++ i) {
//		dp[i] = dp[i-1] + dp[i-2] + dp[i-3]; // 注意只能是+=
//		dp[i] %= 100000;
//	}
//
////	for(int i = 1; i < 20;++i) {
////        printf("%d   ", dp[i]);
////	}
////    1   1   1   3   5   9   17   31   57   105   193   355   653   1201   2209   4063   7473   13745   25281
//    printf("%ld  %d \n",dp[20190324]);
//	return 0;
//}